```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws_organization.random_string.random: Refreshing state... [id=bjt3]
data.external.git: Refreshing state... [id=-]
module.serverless-example-api.module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=524760460508]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws_organization.aws_organizations_account.account must be replaced
-/+ resource "aws_organizations_account" "account" {
      ~ arn              = "arn:aws:organizations::625384516859:account/o-p17ed8s84p/524760460508" -> (known after apply)
      ~ email            = "aws+scaffoldly-bjt3@cnuss.com" -> (known after apply) # forces replacement
      ~ id               = "524760460508" -> (known after apply)
      ~ joined_method    = "CREATED" -> (known after apply)
      ~ joined_timestamp = "2020-08-07T05:11:42Z" -> (known after apply)
      ~ name             = "scaffoldly-bjt3" -> (known after apply) # forces replacement
      ~ parent_id        = "r-agni" -> (known after apply)
      + role_name        = "BootstrapAccessRole" # forces replacement
      ~ status           = "ACTIVE" -> (known after apply)
      - tags             = {} -> null
    }

  # module.aws_organization.random_string.random must be replaced
-/+ resource "random_string" "random" {
      ~ id          = "bjt3" -> (known after apply)
      ~ length      = 4 -> 5 # forces replacement
        lower       = true
        min_lower   = 0
        min_numeric = 0
        min_special = 0
        min_upper   = 0
        number      = true
      ~ result      = "bjt3" -> (known after apply)
        special     = false
        upper       = true
    }

Plan: 2 to add, 0 to change, 2 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```